/*****************************************************************************************************************
                    步进电机      初步测试程序

            安装好ULN2003驱动  接好步进电机  
            这里选择的步进电机的4个IO口为P1口P1^0--P1^3
            速度不可以调节的过快，不然就没有力矩转动了
******************************************************************************************************************/

#include <reg52.h>

unsigned char code F_Rotation[4]={0x01,0x02,0x04,0x08}; //正转表格，换算成二进制 0000 0001，0000 0010，0000 0100，0000 1000
unsigned char code B_Rotation[4]={0x08,0x04,0x02,0x01}; //反转表格，换算成二进制 0000 1000，0000 0100，0000 0010，0000 0001

void Delay(unsigned int i)//延时
{
 while(--i);
}

main()
{
 
 unsigned char i;

 while(1)
 {
  for(i=0;i<4;i++)      //4相
     {
     P1=B_Rotation[i];  //输出对应的相 可以自行换成反转表格
     Delay(500);        //改变这个参数可以调整电机转速
	 }
  }
}